import os, webbrowser, requests
from colorama import Fore
from urllib.request import urlopen
import json
from colorama import Fore
import time
import sys
from getpass import getpass
import secrets
from random import randint

from getpass import getpass
username = input('Enter Username: ')
password = getpass('Enter Password: ')

print(f'''
{Fore.YELLOW}██████████████████████████████████████████        ██
{Fore.YELLOW}██████████████████████████████████            ██████
{Fore.YELLOW}██████████████████                          ████████
{Fore.YELLOW}██████████████    ████████                ██████████
{Fore.YELLOW}██████████    ████████████              ████████████
{Fore.YELLOW}████████  ██████████████              ████    ██████
{Fore.YELLOW}██████  ██████████████            ██████        ████
{Fore.YELLOW}████  ████████████████          ████████████    ████
{Fore.YELLOW}████  ██████████████                  ██████      ██
{Fore.YELLOW}██  ██████████████                  ████████      ██
{Fore.YELLOW}██  ██████████████                ████████████      
    {Fore.YELLOW}██████████████████          ██████████████      
    {Fore.YELLOW}████████████████          ████████████████      
    {Fore.YELLOW}██████████████          ██████████████████      
    {Fore.YELLOW}████████████          ████████████████████      
      {Fore.YELLOW}██████████        ████████████████████        
{Fore.YELLOW}██    ████████                  ████████████      ██
{Fore.YELLOW}██    ██████                ████████████████      ██
{Fore.YELLOW}████    ██████████        ████████████████      ████
{Fore.YELLOW}████      ██████      ██████████████████        ████
{Fore.YELLOW}██████      ██      ████████████████          ██████
{Fore.YELLOW}████████          ██████████████          ██████████
{Fore.YELLOW}██████████    ██████                    ████████████
{Fore.YELLOW}████████    ██████                ██████████████████
{Fore.YELLOW}██████  ████████████████████████████████████████████
{Fore.YELLOW}████  ██████████████████████████████████████████████

{Fore.YELLOW}███████╗██████╗  ██████╗  ██████╗ {Fore.YELLOW}███████╗███████╗██████╗ 
{Fore.YELLOW}██╔════╝██╔══██╗██╔═══██╗██╔═══██╗██╔════╝██╔════╝██╔══██╗
{Fore.YELLOW}███████╗██████╔╝██║   ██║██║   ██║█████╗  █████╗  ██████╔╝
{Fore.YELLOW}╚════██║██╔═══╝ ██║   ██║██║   ██║██╔══╝  ██╔══╝  ██╔══██╗
{Fore.YELLOW}███████║██║     ╚██████╔╝╚██████╔╝██║     ███████╗██║  ██║
{Fore.YELLOW}╚══════╝╚═╝      ╚═════╝  ╚═════╝ ╚═╝     ╚══════╝╚═╝  ╚═╝

''')
print("")
print(f'''{Fore.YELLOW}[1]{Fore.RED}Spoof{Fore.BLUE}Fivem''')
print("")
a = input("\u001b[38;5;46m╚\u001b[38;5;47m══\u001b[38;5;48m[Spo\u001b[38;5;49oofer\u001b[38;5;50m\u001b[38;5;51m]═>\u001b[38;5;7m ")

if a == "1":
    print(f'''
{Fore.YELLOW}Spoofing Fivem
   ''')
time.sleep(2)
   
print('[                    ] 0%')
time.sleep(1)
print('[=====               ] 25%')
time.sleep(1)
print('[==========          ] 50%')
time.sleep(1)
print('[===============     ] 75%')
time.sleep(2)
print('[====================] 100%')
time.sleep(1)


print(f'''{Fore.YELLOW}𝗦𝗽𝗼𝗼𝗳 𝗦𝘂𝗰𝗰𝗲𝘀𝘀𝗳𝘂𝗹𝗹𝘆
   ''')
   
 
   
